export type SiteConfig = typeof siteConfig;

export const siteConfig = {
    name: "omranhouses",
    description: "Make beautiful websites regardless of your design experience.",
    navItems: [
        {
            label: "الرئيسية",
            href: "/",
        },
        {
            label: "عن الشركة",
            href: "/docs",
        },
        {
            label: "مشاريعنا",
            href: "/pricing",
        },
        {
            label: "خدماتنا",
            href: "/blog",
        },
        {
            label: "اتصل بنا",
            href: "/about",
        },
    ],
    navMenuItems: [
        {
            label: "Profile",
            href: "/profile",
        },
        {
            label: "Dashboard",
            href: "/dashboard",
        },
        {
            label: "Projects",
            href: "/projects",
        },
        {
            label: "Team",
            href: "/team",
        },
        {
            label: "Calendar",
            href: "/calendar",
        },
        {
            label: "Settings",
            href: "/settings",
        },
        {
            label: "Help & Feedback",
            href: "/help-feedback",
        },
        {
            label: "Logout",
            href: "/logout",
        },
    ],
    links: {
        backend:'http://127.0.0.1:8000/api',
        github: "https://github.com/nextui-org/nextui",
        twitter: "https://twitter.com/getnextui",
        docs: "https://nextui.org",
        discord: "https://discord.gg/9b6yyZKmH4",
        sponsor: "https://patreon.com/jrgarciadev",
    },

    power:[
        {
        title:'جودة المنتجات',
        description:'نحــرص علــى الحفــاظ علــى جــودة منتجاتنــا كمبــدأ' +
            'راسـ\n' +
            'الجــو\n' +
            'العق\n' +
            '\n' +
            'نؤمـن بـه، ونهـدف مـن خلال الارتقـاء بمسـتوى\n' +
            'دة إلــى تحقيــق رضــا العــملاء، والاســتفادة مــن\n' +
            'ار على المدى المتوسط والبعيد.\n'
    },
        {

        }
    ],




    message:'نقــدم لعملائنــا منتجــات وخدمــات عقاريــة متميــزة بجــودة عاليــة وأســعار تنافســية مــن خلال عمــل مؤسســي و كــوادر مؤهلــة مــع كامــل التزامنــا بالقيم والمبادئ الإسلامية.',


    intro:'                            نشــأت منازل العمران مــع التــزام يتمَّثل بتســليم مشــاريع عقاريــة رائــدة،\n' +
        '                            سـواء كانـت منـازل جديـدة أو اسـتثمار عقـاري ُمتمّيـز، بالإضافـة إلـى تمكيـن\n' +
        '                            كل مالـك أو ُمسـتثمر فـي المسـتقبل مـن الاسـتمتاع بأسـلوب حيـاة معاصـر\n' +
        '                            يتناســب مــع تطلعاتــه، ليقــوده للنجــاح ويســاهم بحفــظ ثرواتــه للأجيــال\n' +
        '                            القادمة.',


    goals:
        ['تطوير آليات تمويل بصيغ استثمارية.' ,
        'بناء علاقات إستراتيجية وفاعلة مع المستثمرين و المكاتب الهندسيةوالمقاولين والموردين.' ,
        'بناء علامة تجارية متميزة.' ,
        'المساهمة الفاعلة برفع وعي أفراد المجتمع بمجالات وأهمية جودةالمساكن' ,
        ],
    vision:'أن نكـون الشـريك الاسـتراتيجي الُمفضـل لتقديـم منتجـات وخدمـات عقارية إبداعية ومتميزة تلبي احتياجات العملاء',

    morals:[
        'الالتزام بالشريعة الإسلامية : التزامنا بها يمثل نواة مصداقيتنا وأساس علاقاتنامع عملائنا وشركائنا وطريقنا لبناء جسر ثقة بيننا وبينهم.' ,
        'عملاؤنا محور اهتمامنا : توفير تجربة عملاء استثنائية في كافة المراحل.' ,
        'المصداقّية : الثقة، الأمانة والاهتمام والشفافـية تمـــثل أسلــوبنا في التعامل مع عملائنا، ووسيلتنا للوصول والتواصل مع شركائنا وأساس تصرفاتنا داخل بيئة العمل.' ,
        'الإبداع : نهتم بإيجاد وخلق أفكار وأساليب جديدة، والاستمرار في تطوير الأفكارالإبداعّية.'
    ]
};
